# -*- coding: utf-8 -*-

'''
Задание 6: Классификатор. (бонусное)

УСЛОВИЕ:
Фрагмент кода, который принимает словарь со значениями элементов разных типов,
а возвращает словарь вида {имя_типа : количество_элементов_этого_типа}.

Пример:
{'a': 1, 3: [1,5], 'e': 'abc', '6': []} >> {'str': 1, 'list': 2, 'int': 1}
'''

__author__ = 'karidon'
__email__ = 'Genek_x@mail.ru'
__date__ = '2016-01-20'


def classifier(m):
	dic = {}
	for v in m.values():
		a = type(v).__name__
		dic[a] = dic.get(a, 0) + 1
	return dic
